#pragma once

/*
120_客户号|134_交易密码|121_资金帐号|125_帐号类别|123_股东代码|110_委托方式|1207
_起始序号|1227_参数|101_交易所名称|5250_客户群组|5251_客户营业部|5252_硬盘序列号
|5253_CPUID|5254_信用交易标识|5255_会话号|5256_客户代码|
===============
143_委托时间|123_股东代码|140_证券代码|141_证券名称|130_买卖标志|131_买卖标志|10
0_交易所代码|145_委托价格|144_委托数量|153_成交价格|152_成交数量|162_撤单数量|14
6_委托编号|194_报价方式|147_状态说明|161_冻结资金|1213_保留信息|
*/
//#define REQUEST_DRWT	1102	// 当日委托

/*
120_客户号|134_交易密码|121_资金帐号|125_帐号类别|123_股东代码|110_委托方式|126_
开始日期|127_终止日期|1207_起始序号|140_证券代码|1227_参数|5250_客户群组|5251_客
户营业部|5252_硬盘序列号|5253_CPUID|5254_信用交易标识|5255_会话号|5256_客户代码|

===============
142_委托日期|123_股东代码|140_证券代码|141_证券名称|130_买卖标志|131_买卖标志|10
0_交易所代码|145_委托价格|144_委托数量|153_成交价格|152_成交数量|162_撤单数量|14
6_委托编号|194_报价方式|161_冻结资金|1213_保留信息|
*/
//#define REQUEST_LSWT	1104	// 历史委托

struct WTLB_STRUCT
{
	int WTRQ;		// 142_委托日期
	int WTSJ;		// 143_委托时间
	char GDDM[32];	// 123_股东代码
	char ZQDM[32];	// 140_证券代码
	char ZQMC[32];	// 141_证券名称
	int MMBZ;		// 130_买卖标志
	int WTLB;		// 131_委托类别
	int JYSDM;		// 100_交易所代码
	double WTJG;	// 145_委托价格
	int WTSL;		// 144_委托数量
	double CJJG;	// 153_成交价格
	int	CDSL;		// 162_撤单数量
	char WTBH[32];	// 146_委托编号
	int BJFS;		// 194_报价方式
	double	DJZJ;	// 161_冻结资金
};


/*
120_客户号|134_交易密码|121_资金帐号|125_帐号类别|123_股东代码|110_委托方式|1207
_起始序号|155_成交编号|101_交易所名称|5250_客户群组|5251_客户营业部|5252_硬盘序
列号|5253_CPUID|5254_信用交易标识|5255_会话号|5256_客户代码|
===============
151_成交时间|123_股东代码|140_证券代码|141_证券名称|130_买卖标志|131_买卖标志|15
3_成交价格|152_成交数量|303_发生金额|155_成交编号|167_撤单标志|146_委托编号|1213
_保留信息|
*/
//#define REQUEST_DRCJ	1108	// 当日成交
/*
120_客户号|134_交易密码|121_资金帐号|125_帐号类别|123_股东代码|110_委托方式|126_
开始日期|127_终止日期|1207_起始序号|140_证券代码|101_交易所名称|5250_客户群组|52
51_客户营业部|5252_硬盘序列号|5253_CPUID|5254_信用交易标识|5255_会话号|5256_客户
代码|
===============
150_成交日期|151_成交时间|123_股东代码|140_证券代码|141_证券名称|130_买卖标志|13
1_买卖标志|153_成交价格|152_成交数量|303_发生金额|304_剩余金额|206_佣金|210_印花
税|207_过户费|208_成交费|155_成交编号|146_委托编号|1213_保留信息|
*/
//#define REQUEST_LSCJ	1110	// 历史成交

struct CJLB_STRUCT
{
	int CJRQ;		// 150_成交日期
	int CJSJ;		// 151_成交时间
	char GDDM[32];	// 123_股东代码
	char ZQDM[32];	// 140_证券代码
	char ZQMC[32];	// 141_证券名称
	int MMBZ;		// 130_买卖标志
	int WTLB;		// 131_委托类别
	double CJJG;	// 153_成交价格
	int	CJSL;		// 152_成交数量
	double	FSJE;	// 303_发生金额
	double	SYJE;	// 304_剩余金额
	double	YJ;		// 206_佣金
	double	YHS;	// 210_印花税
	double	GHF;	// 207_过户费
	double	CJF;	// 208_成交费
	char CJBH[32];	// 155_成交编号
	char WTBH[32];	// 146_委托编号
};